#include <iostream>
#include <limits>
using namespace std;  //Подключение пространства имён std

int main()
{
	setlocale(LC_ALL, "Russian");
	int score; //Ввод переменной
	cout << "Введите количество баллов (0-100): ";  //Вывод строки
	cin >> score;  //Ввод данных
	while (cin.fail() || score < 0 || score > 100) {    //цикл работает пока есть ошибка в типе данных или число равно нулю или отрицательно
		cout << "Введите корректное число!\n ";
		cin.clear();
		cin.ignore(numeric_limits<streamsize>::max(), '\n');  //Очистка буфера ввода
		cout << "Введите количество баллов (0-100): ";  //Вывод строки
		cin >> score;  //Новый запрос данных
	}
	switch (score / 10) {
	case 10: //Сравнение с 10
	case 9:  //Сравнение с 9
		cout << "A, отлично" << endl; //Вывод строки
		break;
	case 8: //Сравнение с 8
		cout << "B, очень хорошо" << endl; //Вывод строки
		break;
	case 7: //Сравнение с 7
	case 6: //Сравнение с 6
		if (score >= 65) {  //Если >65, выводится C
			cout << "C, хорошо" << endl;//Вывод строки
		}  else {  //Иначе выводится D
			cout << "D, удовлетворительно" << endl; //Вывод строки;
		}
		break;
	case 5: //Сравнение с 5
		cout << "D, удовлетворительно" << endl; //Вывод строки
		break;
	case 4:  //Сравнение с 4
		cout << "E, достаточно" << endl; //Вывод строки
		break;
	case 3:  //Сравнение с 3
		if (score >= 35) { //Если > 35, выводится E
			cout << "E, достаточно" << endl;//Вывод строки
		} 
		else {  //Иначе выводится FX
			cout << "FX, неудовлетворительно, повторная сдача" << endl; //Вывод строки
		}
		break;
	case 2: //Сравнение с 2
		cout << "FX, неудовлетворительно, повторная сдача" << endl; //Вывод строки
		break;
	default:  //Если не одно равенство не выполняется, запускается следующий алгоритм
		cout << "F, неудовлетворительно, полный повторный курс обучения" << endl; //Вывод строки
	}
	return 0;
}
