#include <iostream>
using namespace std;  //Подключение пространства имён std

int main()
{
	setlocale(LC_ALL, "Russian");
	int month; //Ввод переменной
	cout << "Введите номер месяца (1-12): ";  //Вывод строки
	cin >> month;  //Ввод данных
	switch (month) {
	case 1: //Сравнение с 1
		cout << "Зима, 31 день"; //Вывод строки
		break;
	case 2: //Сравнение с 2
		cout << "Зима, 28 дней"; //Вывод строки
		break;
	case 3: //Сравнение с 3
		cout << "Весна, 31 день";//Вывод строки
		break;
	case 4: //Сравнение с 4
		cout << "Весна, 30 дней"; //Вывод строки
		break;
	case 5: //Сравнение с 5
		cout << "Весна, 31 день"; //Вывод строки
		break;
	case 6: //Сравнение с 1
		cout << "Лето, 30 дней"; //Вывод строки
		break;
	case 7: //Сравнение с 1
		cout << "Лето, 31 день"; //Вывод строки
		break;
	case 8: //Сравнение с 1
		cout << "Лето, 31 день"; //Вывод строки
		break;
	case 9: //Сравнение с 1
		cout << "Осень, 30 дней"; //Вывод строки
		break;
	case 10: //Сравнение с 1
		cout << "Осень, 31 день"; //Вывод строки
		break;
	case 11: //Сравнение с 1
		cout << "Осень, 30 дней"; //Вывод строки
		break;
	case 12: //Сравнение с 1
		cout << "Зима, 31 день"; //Вывод строки
		break;
	default:  //Если не одно равенство не выполняется, запускается следующий алгоритм
		cout << "Число должно быть в диапазоне от 1 до 12" << endl; //Вывод строки
	}
	return 0;
}
