#include <iostream>
#include <iomanip>
#include <limits>
#include <cmath>
using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    double a, b, h, Ymin, inmin, st, fin;
    inmin = 0;
    int count = 0; //Введение счётчика
    cout << "Введите начало интервала a: ";
    cin >> a;
    while (cin.fail()) {    //цикл работает пока есть ошибка в типе данных
        cout << "Введите корректное число!\n ";
        cin.clear();
        cin.ignore(numeric_limits<streamsize>::max(), '\n');  //Очистка буфера ввода
        cout << "Введите начало интервала a: ";  //Вывод строки
        cin >> a;  //Новый запрос данных
    }
    cout << "Введите конец нитервала b: ";
    cin >> b;
    while (cin.fail() || a > b) {    //цикл работает пока есть ошибка в типе данных
        cout << "Введите корректное число (b >= a)!\n ";
        cin.clear();
        cin.ignore(numeric_limits<streamsize>::max(), '\n');  //Очистка буфера ввода
        cout << "Введите конец нитервала b: ";  //Вывод строки
        cin >> b;  //Новый запрос данных
    }
    cout << "Введите шаг h:";
    cin >> h;
    while (cin.fail() || h <= 0) {    //цикл работает пока есть ошибка в типе данных
        cout << "Введите корректное число (h > 0)!\n ";
        cin.clear();
        cin.ignore(numeric_limits<streamsize>::max(), '\n');  //Очистка буфера ввода
        cout << "Введите шаг h: ";  //Вывод строки
        cin >> h;  //Новый запрос данных
    }
    Ymin = a*a + 6*a - 10;
    cout << "============================" << endl; //Вывод строки
    cout << "     x   |y = x*x + 6*x - 10" << endl; //Вывод строки
    cout << "============================" << endl; //Вывод строки
    cout << fixed << setprecision(4);
    for (double x = a; x <= b + 1e-9; x = x + h) { //Пока х находится в дивпазоне (a;b) выполняется следующий алгоритм
        double y = x*x + 6*x - 10; // Вычисление значения функции
        cout << setw(8) << x << " | " << setw(17) << y << endl; //Вывод строки с определённым количеством символов
        // Наименьшее значение функции
        if (y < Ymin) {  
            Ymin = y;
        }
        // Опреденение интервалов с корнями
        if (inmin * y <= 0 && x != a) {  //Проверка на корни
            if (count == 0) {  //Если корней не было значение записывается в переменную st
                st = x;
                count = 1;
            }
            else {  //Иначе данные сохранятся в переменную fin
                fin = x;
                count = 2;
            }
        }
        inmin = y;
    }
    cout << "============================" << endl; //Вывод строки
    cout << "Наименьшее значение функции на отрезке (" << a << ";" << b << "):" << Ymin << endl; // Вывод наименьшего значения функции
    switch (count) {  //В зависимости от количества корней выводятся разные строки
    case 0:
        cout << "На интервале [" << a << ";" << b << "] корней нет" << endl;
        break;
    case 1:
        cout << "На интервале [" << st - h << ";" << st << "] есть корень" << endl;
        break;
    case 2:
        cout << "На интервале [" << st - h << ";" << st << "] есть корень" << endl;
        cout << "На интервале [" << fin - h << ";" << fin << "] есть корень" << endl;
        break;
    }
    return 0;
}
