#include <iostream>
using namespace std;  //Подключение пространства имён

int main() {
    setlocale(LC_ALL, "Russian");
    cout << "Тип треугольника" << '\n'; //Вывод строки
    double a , b , c , max;  //Объявление переменных
    cout << "Введите длину стороны a: " ;  //Вывод строки
    cin >> a;  //Ввод данных
    while (cin.fail() or a <= 0) {    //цикл работает пока есть ошибка в типе данных или число равно нулю или отрицательно
        cout << "Введите корректное число!\n ";
        cin.clear();
        cin.ignore(numeric_limits<streamsize>::max(), '\n');  //Очистка буфера ввода
        cout << "Введите длину стороны a ";  //Вывод строки
        cin >> a;  //Новый запрос данных
    }
    cout << "Введите длину стороны b: ";  //Вывод строки
    cin >> b;  //Ввод данных
    while (cin.fail() or b <= 0) {    //цикл работает пока есть ошибка в типе данных или число равно нулю или отрицательно
        cout << "Введите корректное число!\n ";
        cin.clear();
        cin.ignore(numeric_limits<streamsize>::max(), '\n');  //Очистка буфера ввода
        cout << "Введите длину стороны b ";  //Вывод строки
        cin >> b;  //Новый запрос данных
    }
    cout << "Введите длину стороны c: ";  //Вывод строки
    cin >> c;  //Ввод данных
    while (cin.fail() or c <= 0) {    //цикл работает пока есть ошибка в типе данных или число равно нулю или отрицательно
        cout << "Введите корректное число!\n ";
        cin.clear();
        cin.ignore(numeric_limits<streamsize>::max(), '\n');  //Очистка буфера ввода
        cout << "Введите длину стороны c ";  //Вывод строки
        cin >> c;  //Новый запрос данных
    }
    if (a > b) {  //Определяем наибольшую сторону для дальнейших вычислений
        max = a;
        if (a > c) {
            max = a;
        }
        else {
            max = c;
        }
    } else {
        max = b;
        if (b > c) {
            max = b;
        }
        else {
            max = c;
        }
    } 
    if (max < (a + b + c - max)) {  //Проверяем существование треугольника
        if (a == b == c) {  //Проверка на равносторонний треугольник
            cout << "Треугольник равносторонний" << endl;
        }
        else if (a == b || a == c || b == c) {  //Проверка на равнобедренный треугольник
            cout << "Треугольник равнобедренный" << endl;
        }
        else if (max == a) {  //Проверка на прямоугольный треугольник, если a большая сторона
            if (a * a == b * b + c * c) {
                cout << "Треугольник  прямоугольный" << endl;
            }
            else {
                cout << "Треугольник разносторонний" << endl;
            }
        }
        else if (max == b) {  //Проверка на прямоугольный треугольник, если b большая сторона
            if (b * b == a * a + c * c) {
                cout << "Треугольник  прямоугольный" << endl;
            }
            else {
                cout << "Треугольник разносторонний" << endl;
            }
        }
        else if (max == c) {  ////Проверка на прямоугольный треугольник, если c большая сторона
            if (c * c == b * b + a * a) {
                cout << "Треугольник  прямоугольный" << endl;
            }
            else {
                cout << "Треугольник разносторонний" << endl;
            }
        }
    }
    else {  //Если ни одно условие не является верным, треугольника не существует
        cout << "Треугольника не существует" << endl;
    }
    
    
    return 0;
}
